In [1]:
import pandas as pd
import numpy as np

In [2]:
d = {
    'col1': [1, 2, 3 ],
    'col2': [3, 4,np.nan ],
    'col3': [3, 4,np.nan ]
    }
df = pd.DataFrame(data=d)
df

   col1  col2  col3
0     1   3.0   3.0
1     2   4.0   4.0
2     3   NaN   NaN

In [3]:
df2 = pd.DataFrame(
    np.array(
        [
            [1, 2, 3],
            [4, np.nan, 6],
            [7, 8, 9],
            [1, 2, 3],
            [1,np.nan,np.nan]
        ]),
    columns=['a', 'b', 'c'])
df2

     a    b    c
0  1.0  2.0  3.0
1  4.0  NaN  6.0
2  7.0  8.0  9.0
3  1.0  2.0  3.0
4  1.0  NaN  NaN

In [4]:
df2['d']=3
df2

     a    b    c  d
0  1.0  2.0  3.0  3
1  4.0  NaN  6.0  3
2  7.0  8.0  9.0  3
3  1.0  2.0  3.0  3
4  1.0  NaN  NaN  3

In [5]:
filaz= [1,-1,1,-1,1]
df2['z']=filaz
df2

     a    b    c  d  z
0  1.0  2.0  3.0  3  1
1  4.0  NaN  6.0  3 -1
2  7.0  8.0  9.0  3  1
3  1.0  2.0  3.0  3 -1
4  1.0  NaN  NaN  3  1

In [6]:
df2['e']=df2['a']+df2['b']
df2

     a    b    c  d  z     e
0  1.0  2.0  3.0  3  1   3.0
1  4.0  NaN  6.0  3 -1   NaN
2  7.0  8.0  9.0  3  1  15.0
3  1.0  2.0  3.0  3 -1   3.0
4  1.0  NaN  NaN  3  1   NaN

In [7]:
df2['a']=pow(df2['a'],2)
df2

      a    b    c  d  z     e
0   1.0  2.0  3.0  3  1   3.0
1  16.0  NaN  6.0  3 -1   NaN
2  49.0  8.0  9.0  3  1  15.0
3   1.0  2.0  3.0  3 -1   3.0
4   1.0  NaN  NaN  3  1   NaN

In [8]:
columna = df2['c']
columna

0    3.0
1    6.0
2    9.0
3    3.0
4    NaN
Name: c, dtype: float64

In [9]:
df3 = df2[['a','c','e']]
df3

      a    c     e
0   1.0  3.0   3.0
1  16.0  6.0   NaN
2  49.0  9.0  15.0
3   1.0  3.0   3.0
4   1.0  NaN   NaN

In [10]:
df4 = df3.dropna()
df4

      a    c     e
0   1.0  3.0   3.0
2  49.0  9.0  15.0
3   1.0  3.0   3.0

In [11]:
df5 = df3.fillna(0)
df5

      a    c     e
0   1.0  3.0   3.0
1  16.0  6.0   0.0
2  49.0  9.0  15.0
3   1.0  3.0   3.0
4   1.0  0.0   0.0

In [12]:
df6 = df5[df5['c']>5]
df6

      a    c     e
1  16.0  6.0   0.0
2  49.0  9.0  15.0

In [13]:
df5.iloc[2]

a    49.0
c     9.0
e    15.0
Name: 2, dtype: float64

In [14]:
df5.iloc[[0,2]] =df5.iloc[[0,2]]  - 5 
df5

      a    c     e
0  -4.0 -2.0  -2.0
1  16.0  6.0   0.0
2  44.0  4.0  10.0
3   1.0  3.0   3.0
4   1.0  0.0   0.0

In [15]:
df5.loc[3,'e']=-5
df5

      a    c     e
0  -4.0 -2.0  -2.0
1  16.0  6.0   0.0
2  44.0  4.0  10.0
3   1.0  3.0  -5.0
4   1.0  0.0   0.0

In [16]:
df5["a"].unique()

array([-4., 16., 44.,  1.])

# Series

In [17]:
data = np.array(['g','e','e','k','s'])
 
ser = pd.Series(data)

ser

0    g
1    e
2    e
3    k
4    s
dtype: object

In [18]:

n = range(10)

exp = (1+n)/(np.exp(n))
n = np.arange(0,4*np.pi,np.pi*0.1)

cos = np.cos(n)
sin = np.sin(n)

TypeError: unsupported operand type(s) for +: 'int' and 'range'

In [ ]:
ser_exp = pd.Series(exp)
ser_exp

In [ ]:
ser_exp.plot()

In [ ]:
ser_cos = pd.Series(cos)
ser_cos

In [ ]:
ser_cos.plot()

In [ ]:
ser_sin = pd.Series(sin)
ser_sin

In [ ]:
ser_sin.plot()